app/views/events/_form.html.erb

	<%= f.label :artist %><br />
 	<%= f.select :artist_id, Artist.all.collect {|c| [ c.name, c.id ] } %> or <%=link_to 'add a new one', new_artist_path(:redirect=>true)%>
---
SELECT "artists".* FROM "artists"