app/views/events/index.html.erb

SELECT "tickets".* FROM "tickets" WHERE ("tickets".event_id = 3)
SELECT COUNT(*) FROM "tickets" WHERE ("tickets".event_id = 3)
---

			<%= link_to event.tickets.size, "/events/#{event.id}/tickets"%>