app/views/tickets/index.html.erb

SELECT "tickets".* FROM "tickets" WHERE ("tickets".ticket_group_id = 2) LIMIT 1
---
<% @ticket_groups.each do |group| %>
<%info=group.tickets.first%>