app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(params[:artist])

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "url", "onTour", "created_at", "updated_at") VALUES ('Lady Gaga', 'http://www.ladygaga.com', NULL, '2011-04-21 19:34:47.900454', '2011-04-21 19:34:47.900454')

  def destroy
    @artist = Artist.find(params[:id])
    @artist.destroy
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = 5 LIMIT 1
DELETE FROM "artists" WHERE "artists"."id" = 5