app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
SELECT "tickets".* FROM "tickets" WHERE ("tickets".event_id = 7)
---
  def show
    @event = Event.find(params[:id])
    	@quantity=0
    	groups=[]
			@event.tickets.each do |t|

INSERT INTO "events" ("name", "date", "notes", "created_at", "updated_at", "artist_id", "venue_id") VALUES ('', NULL, 'some note', '2011-04-26 14:39:36.035001', '2011-04-26 14:39:36.035001', 1, 1)
---
  def create
    #used for user created events
    @event = Event.new(params[:event])
   if @event.name==''
     @event.name=@event.artist.name + ' at ' + @event.venue.name + " (#{@event.date.strftime("%a, %b %e %Y")})"
  end
  @event.created_by=current_user.id

SELECT "events".* FROM "events" WHERE "events"."id" = 2 LIMIT 1
UPDATE "events" SET "name" = 'An EVent Title', "artist_id" = 2, "venue_id" = 2, "date" = '2011-04-26 17:23:00.000000', "updated_at" = '2011-04-26 17:24:06.434727' WHERE "events"."id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])