app/controllers/sales_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 11 LIMIT 1
---
  def new
    @sale = Sale.new
    @ticket=Ticket.find(params[:ticket_id])