app/controllers/ticket_groups_controller.rb

  def show
    @ticket_group=TicketGroup.find(params[:id])
---
SELECT "ticket_groups".* FROM "ticket_groups" WHERE "ticket_groups"."id" = 8 LIMIT 1