app/controllers/tickets_controller.rb

INSERT INTO "ticket_groups" ("section", "row", "quantity") VALUES ('Floor', 'GA', NULL)
INSERT INTO "tickets" ("quantity", "cost", "bought_on", "in_hand", "kind", "sold", "notes", "created_at", "updated_at", "event_id", "artist_id", "venue_id", "location") VALUES (2, 145, '2009-12-21 02:46:00.000000', '2009-12-21 02:46:00.000000', 'E Ticket', 0, '', '2011-04-29 03:13:03.206502', '2011-04-29 03:13:03.206502', 7, 12, 3, 'ORCH CTR ROW GG')
---
  def create

    #create new ticket for each seat - @ticket is ticket 0, so start with 1
    q=params[:quantity].to_i
    n=0
    seats=params[:seats].split(",")

    session[:seller].blank? ? userid=current_user.id : userid = session[:seller]
     @ticket_group=TicketGroup.find(params[:ticket][:ticket_group_id])
    @mygroup = MyTicketGroup.find_or_create(userid, @ticket_group.id)

SELECT "tickets".* FROM "tickets" WHERE ("tickets".ticket_group_id = 2) LIMIT 1
SELECT "tickets".* FROM "tickets"
---
  def index
    groups=[]
    @ticket_groups=[]
    if params[:event_id]
      if params[:user_id]
        @tickets = Ticket.find_all_by_event_id(params[:event_id], :conditions=>["user_id=?", params[:user_id]])
      else
        @tickets = Ticket.find_all_by_event_id(params[:event_id])
      end

      for ticket in @tickets
        groups<<ticket.ticket_group

      end
      @ticket_groups=groups.uniq!
    else
      if params[:user_id]
        @tickets=Ticket.find_all_by_user_id(params[:user_id])
      else
        @tickets=Ticket.all

SELECT "events".* FROM "events" WHERE "events"."id" = 7 LIMIT 1
SELECT "events".* FROM "events"
---
  def new
    @ticket = Ticket.new
    if params[:event_id]
      @ticket.event=Event.find(params[:event_id])

      if params[:ticket_group]
        @ticket.ticket_group=params[:ticket_group]
      end

        @ticket_groups=TicketGroup.find_all_by_event_id(@ticket.event.id)
        more=Ticket.find_all_by_event_id(@ticket.event.id)
        more.each do |ticket|

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 5 LIMIT 1
---
  def edit
    @ticket = Ticket.find(params[:id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = 5 LIMIT 1
UPDATE "tickets" SET "sold" = 1, "updated_at" = '2011-04-29 03:24:10.375656' WHERE "tickets"."id" = 5
---
  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])