app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues" WHERE "venues"."id" = 1 LIMIT 1
---
  def show
    @venue = Venue.find(params[:id])

INSERT INTO "venues" ("name", "capacity", "url", "created_at", "updated_at", "state") VALUES ('Odeum', 6500, 'http://1stbankcenter.com', '2011-04-25 18:55:19.574550', '2011-04-25 18:55:19.574550', 'CO')
---
  def create
    @venue = Venue.new(params[:venue])

    respond_to do |format|
      if @venue.save