app/views/sales/_form.html.erb

    <%= f.label :marketplace, 'market sold in' %><br />
    <%= f.select :marketplace_id, Marketplace.all.collect {|c| [ c.name, c.id ] }  %>
---
SELECT "marketplaces".* FROM "marketplaces"